{
  "header": {
    "theme": {
      "light": "Light",
      "dark": "Dark",
      "system": "System"
    },
    "description": "My name is Gustavo. "
  },
  "about": {
    "title": "About me",
    "description": "I have over 3 years of experience with <strong>HTML</strong>, <strong>CSS</strong>, <strong>JavaScript</strong>, <strong>TypeScript</strong>, <strong>Tailwind CSS</strong>, <strong>ReactJS</strong>, <strong>Next.js</strong>, <strong>Git</strong>, <strong>GitHub</strong>, and more. I love studying and learning things, thanks to my curiosity and problem-solving experience."
  },
  "works": {
    "title": "Work Experience",
    "present": "Currently",
    "remote": "Remote",
    "hybrid": "Hybrid",
    "jobs": {
      "loomi": {
        "position": "Front-end Developer",
        "description": "Development of modern web applications using React, Next.js and TypeScript. Implementation of state management with React Query for request optimization and caching. Form and schema validation with Zod, ensuring type-safety and runtime validation. Working with reusable component architecture and clean code patterns."
      },
      "beecorp": {
        "position": "Front-end Developer",
        "description": "Implementation of new features and platform maintenance with React 18, Next.js 14+ and TypeScript. Performed migration from React 16 and Next.js 12 to newer versions, including adjustments with codemods. Implemented internationalization support with react-i18next, expanding operations to USA and Spain. Developed Cora, an AI chatbot integrated with OpenAI, focused on psychological support."
      },
      "quackity-studios": {
        "position": "Front-end Developer",
        "description": "Developed an internal control panel for social media account administration and management using React, Vite, React Router Dom, and TypeScript. Additionally, I was one of the main developers of the QSMP landing page, implementing Next.js with server components, TailwindCSS, and TypeScript for efficient server-side content rendering."
      },
      "encapse-arquitetura": {
        "position": "Front-end Developer",
        "description": "Developed the application using React, Tailwind CSS, React Hook Form with Zod, and implemented functions to send emails to clients and process data, integrating with the company's database."
      },
      "galorys": {
        "position": "Front-end Developer",
        "description": "Developed interactive and responsive user interfaces using React, Styled Components, and TypeScript, delivering a modern and adaptable visual experience. Integrated APIs with the backend to ensure smooth communication between the interface and system functionalities, enabling effective interaction."
      },
      "shield-ethical": {
        "position": "Front-end Developer",
        "description": "Developed an interactive and responsive landing page focused on user experience, following pixel-perfect design principles with high standards. Using HTML5, CSS3, and JavaScript, created a dashboard with a modern and adaptable design."
      },
      "hide-pagamentos": {
        "position": "Front-end Developer",
        "description": "Developed a landing page focused on optimizing user experience, following pixel-perfect design principles to create a modern and adaptable interface. Using HTML5, CSS3, and JavaScript, built a responsive and interactive landing page."
      },
      "galorys-gta": {
        "position": "Front-end Developer",
        "description": "Developed a landing page for a GTA 5 Role Play website, including the design concept in Figma. Technologies used included React, Styled Components, and TypeScript."
      }
    }
  },
  "skills": {
    "title": "Skills"
  },
  "education": {
    "title": "Education",
    "educations": {
      "uninassau": {
        "title": "Uninassau - Distance Learning",
        "description": "I have currently paused my Systems Analysis and Development degree at Uninassau. Although I already have prior knowledge, I recognize the importance of the course to improve my programming skills."
      }
    }
  }
}